Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/redundancy/redundancy_procedures.html.txt.tmx
Source language: en
Languages: ga

source: Employers are obliged to follow certain procedures when an employee becomes redundant
ga: Tá dualgas ar fhostóirí in Éirinn nósanna imeachta áirithe a leanúint nuair a dhéantar fostaí iomarcach

source: Redundancy occurs where you lose your job due to circumstances such as the closure of the business or a reduction in the number of staff
ga: Tarlaíonn iomarcaíocht nuair a chailleann tú do phost toisc cúinsí cosúil le dúnadh an ghnó nó laghdú ar an líon foirne

source: The Redundancy Payments Acts 1967–2014 provide a minimum entitlement to a redundancy payment for employees who have a set period of service with the employer
ga: Soláthraíonn na hAchtanna um Íocaíochtaí Iomarcaíochta 1967–2014 íostheidlíocht d'íocaíocht iomarcaíochta d'fhostaithe a bhfuil tréimhse socraithe seirbhíse acu lena bhfostóir

source: Not all employees are entitled to this statutory redundancy payment, even where a redundancy situation exists
ga: Níl gach fostaí i dteideal na híocaíochta iomarcaíochta reachtúil seo, fiú amháin áit a bhfuil cás iomarcaíochta i réim

source: You can read our document on qualifying for redundancy
ga: Is féidir leat seiceáil má cháilíonn tú d'iomarcaíocht anseo

source: Employer rebate abolition: There is no statutory redundancy employer rebate where the date of dismissal due to redundancy is on or after 1 January 2013
ga: Cealú lacáiste an fhostóra: Ní íocfar aon lacáiste fostóra le haghaidh iomarcaíochta reachtúil i gcás go mbristear duine as post ar chúis iomarcaíochta ar an 1 Eanáir 2013 nó dá éis

source: In addition to the provisions in the legislation as regards collective redundancies your employer must follow certain fair procedures that is, to give you at least 2 weeks' notice and on the date of dismissal pay your redundancy payment
ga: Chomh maith leis na forálacha sa reachtaíocht maidir le comhiomarcaíochtaí, caithfidh d'fhostóir nósanna imeachta áirithe atá cóir a leanúint. 'Sé sin, fógra ar a laghad dhá sheachtain a thabhairt agus an íocaíochta iomarcaíochta a íoc ar dháta na dífhostaíochta

source: There are also various procedures with regard to selection for redundancy, alternative work and time off
ga: Tá nósanna imeachta éagsúla chomh maith maidir le roghnú um iomarcaíocht, obair mhalartach agus am saor

source: In selecting a particular employee for redundancy, an employer should apply selection criteria that are reasonable and are applied in a fair manner
ga: Agus fostóir ag roghnú fostaí le hiomarcaíochta, ba chóir dó critéir roghnaithe a chuir i bhfeidhm go réasúnta agus go cothrom

source: You are entitled to bring a claim for unfair dismissal if you consider that you were unfairly selected for redundancy or consider that a genuine redundancy situation did not exist
ga: Tá tú i dteideal gearán a dhéanamh le haghaidh dífhostú éagórach má cheapann tú gur roghnaíodh go héagórach tú le haghaidh iomarcaíochta nó má cheapann tú nach raibh cás iomarcaíochta ann

source: Examples of these situations might include where the custom and practice in your workplace has been last in, first out and your selection did not follow this procedure
ga: Samplaí eile de seo ná nuair a leantar an nós 'is déanaí isteach is túisce amach' i d'ionad oibre ach nár leanadh leis i do chás-sa

source: Another example may be where your contract of employment sets out criteria for selection which were not subsequently followed
ga: Sampla eile ná nuair a leagadh critéar roghnaithe amach i gconradh fostaíochta nár leanadh leis

source: Under the unfair dismissals legislation, selection for redundancy based on certain specific grounds is considered unfair
ga: De réir na reachtaíochta um dhífhostú éagórach, meastar roghnú le haghaidh iomarcaíochta, déanta ar bhoinn áirithe a bheith éagórach

source: These include redundancy as the result of an employee's trade union activity, pregnancy or religious or political opinions
ga: San áireamh anseo tá iomarcaíocht de bharr gníomhaíochtaí ceardchumainn an fhostaí, toircheas an fhostaí nó tuairimí an fhostaí i leith an chreidimh nó na polaitíochta

source: The employment equality legislation also prohibits selection for redundancy that is based on any of the following 9 grounds: gender, civil status, family status, age, disability, religious belief, race, sexual orientation or membership of the Traveller community
ga: Leis sin, cuireann an reachtaíocht ar chomhionannas fostaíochta cosc ar roghnú um iomarcaíocht ar na naoi mbonn seo a leanas: inscne, stádas sibhialta, stádas clainne, aois, míchumas, creideamh, cine, claonadh gnéasach, nó ballraíocht den Lucht Siúil

source: As with any dismissal, an employer must act reasonably when dismissing an employee in a redundancy situation
ga: Cosúil le dífhostú ar bith, caithfidh an fostóir gníomhú go réasúnta nuair atá fostaí á d(h)ífhostú i gcás iomarcaíochta

source: This requires prior consultation with you before the decision is made
ga: Is gá go mbeadh comhairliúchán leat roimh cinneadh a bheith déanta

source: In addition, your employer should consider all options including possible alternatives
ga: Ina theannta sin, ba chóir don fhostóir s'agat na roghanna ar fad a mheas ina chuimsítear roghanna malartacha a d'fhéadfadh a bheith ann

source: If your employer makes you a reasonable offer of alternative work, and you refuse it, you may lose your entitlement to a redundancy payment
ga: Má dhéanann d'fhostóir tairiscint réasúnta ar obair mhalartach duit, agus má dhiúltaíonn tú í, d'fhéadfá do theidlíocht ar íocaíocht iomarcaíochta a chailliúint

source: Generally speaking, alternatives which involve a loss of status or worsening of the terms and conditions of your employment would not be considered reasonable
ga: Go ginearálta, ní bhreathnófaí ar roghanna malartacha go mbaineann cailliúint stádais nó téarmaí agus coinníollacha níos measa leo mar roghanna réasúnta

source: Similarly, you may be justified in refusing an offer that involves you travelling an unreasonable distance to work
ga: Ar an mbealach céanna, d'fhéadfá a bheith ceart tairiscint a dhiúltú ina bhaineann fad míréasúnta taistil chun na hoibre

source: You may take up an alternative on trial for up to 4 weeks
ga: Is féidir leat obair mhalartach a thógáil ar bhonn trialach suas go dtí ceithre seachtainí

source: Where the alternative involves a reduction of 50% or more in hours or pay, working under the new arrangements for up to 52 weeks will not count as an acceptance
ga: Nuair a bhaineann laghdú 50% nó níos mó in uaireanta nó pá leis an obair mhalartach, ní mheasfar hoibriú faoi na socruithe nua suas go dtí 52 seachtainí mar ghlacadh

source: If you accept a new contract or re-engagement with immediate effect and the terms do not differ from those of the previous contract, you will not be entitled to claim redundancy
ga: Má ghlacann tú le conradh nua nó athfhostú le héifeacht láithreach agus nach bhfuil na téarmaí difriúil uathu sin sa chonradh roimhe, ní bheidh tú i dteideal iomarcaíocht a éileamh

source: This also applies if you refuse such an offer unreasonably
ga: Baineann sé seo chomh maith má dhiúltaíonn tú tairiscint mar seo go míréasúnta

source: If you accept an offer in writing from your employer for a new and different contract which will take effect within 4 weeks of the ending of the previous contract, you will not be entitled to claim redundancy
ga: Má ghlacann tú leis an tairiscint i scríbhinn ó d'fhostóir ar chonradh nua agus difriúil a bheidh éifeachtach laistigh de cheithre seachtainí ó dheireadh an chonartha roimhe, ní bheidh tú i dteideal iomarcaíocht a éileamh

source: Equally, if you refuse such an offer unreasonably, you will lose your right to a redundancy payment
ga: Ar an mbealach céanna, má dhiúltaíonn tú tairiscint mar seo go míréasúnta, caillfidh tú do cheart ar íocaíocht iomarcaíochta

source: Your justifiable refusal of an offer of alternative work, followed by dismissal, may, depending on the circumstances, entitle you to seek statutory redundancy or make a claim for unfair dismissal
ga: D'fhéadfadh do dhiúltú inchosanta ar thariscint d'obair mhalartach, agus dífhostú ina dhiaidh, ag brath ar na cúinsí, a chiallú go bhfuil tú i dteideal d'iomarcaíocht reachtúil nó éileamh ar dhífhostú éagórach a dhéanamh

source: Any offer of alternative work should be given to you in writing and you are entitled to full information concerning the details of the offer
ga: Ba chóir aon tairiscint d'obair mhalartach a thabhairt duit i scríbhinn agus tá tú i dteideal d'fhaisnéis iomlán a fháil maidir le sonraí na tairisceana

source: You are entitled to a minimum of 2 weeks' written notice of redundancy
ga: Tá tú i dteideal d'fhógra scríofa 2 sheachtain iomarcaíochta ar a laghad

source: This notice period goes up depending on the period of service
ga: Imíonn an tréimhse fógra seo suas ag brath ar an tréimhse seirbhíse

source: │Between 2-5 years │2 weeks │
ga: │Idir 2-5 │2 sheachtain │

source: │Between 5-10 years │4 weeks │
ga: │Idir 5-10 │4 seachtainí │

source: │Between 10-15 years │6 weeks │
ga: │Idir 10-15 │6 seachtainí │

source: │Over 15 years │8 weeks │
ga: │Os cionn 15 │8 seachtainí │

source: Notice when on lay-off or short time: If you have been laid off or put on short-time work, this means that your contract of employment is temporarily suspended
ga: Leagan as agus gearr-am: Má leagadh as tú nó má cuireadh ar obair ghearr-ama tú, ciallaíonn sé sin go bhfuil do chonradh fostaíochta curtha ar fionraí go sealadach

source: If your employer then decides to make you redundant, he or she must re-activate your contract in order to dismiss you on grounds of redundancy
ga: Má ghlacann d’fhostóir cinneadh tú a dhéanamh iomarcach ansin, ní mór dó/di do chonradh a athghníomhú chun tú a dhíbhe ar fhoras iomarcaíochta

source: When your employer gives notice of redundancy you are entitled to the full notice period
ga: Nuair a thugann d’fhostóir fógraí faoi iomarcaíocht tá tú i dteideal tréimhse fógra iomlán

source: If you are made redundant and you are not required to work out your notice you are entitled to payment in lieu of notice which is your normal pay for that notice period
ga: Má dhéantar iomarcach tú agus mura bhfuil ort obair ar feadh do thréimhse fógra tá tú i dteideal íocaíochta in ionad fógra atá comhionann le do ghnáthphá don tréimhse fógra sin

source: For example, if you have been on short-time work and your employer then makes you redundant your payment in lieu of notice is based on the hours of work in your contract of employment, not on the short-time hours of work
ga: Mar shampla, má bhí tú ar obair ghearr-ama agus má dhéanann d’fhostóir iomarcach tú ansin tá d’íocaíocht in ionad fógra bunaithe ar na huaireanta oibre i do chonradh fostaíochta, seachas ar na huaireanta oibre gearr-ama

source: If you are being made redundant, you are entitled to reasonable paid time off in order to look for a new job
ga: Má tá tú á dhéanamh iomarcach, tá tú i dteideal d'am saor réasúnta atá íoctha ionas gur féidir leat post nua a chuardach

source: This right is set down in law in Section 7 of the Redundancy Payments Act 1979. (You should note that while the Redundancy Acts have been amended a number of times the provisions as set down in 1979 for time off, still remain in force today.)
ga: Tá an ceart seo leagtha síos sa dlí in Alt 7 den Acht um Íocaíochtaí Iomarcaíochta 1979 (Ba chóir duit nótáil cé gur leasaíodh na hAchtanna Iomarcaíochta cúpla babhta, tá na forálacha a leagadh síos i 1979 maidir leis an am saor, mar an gcéanna fós inniu.)

source: You are entitled to any holidays that are outstanding or payment in lieu of holiday
ga: Tá tú i dteideal aon laethanta saoire atá fágtha nó íocaíocht do na laethanta saoire sin

source: Leaving before your notice expires
ga: Ag fágáil roimh don fhógra s'agat críochnú

source: Between receiving your notice of redundancy and the date your employment ends, you may give your employer notice that you wish to leave before the end of your notice period
ga: Idir d'fhógra iomarcaíochta a aimsiú agus an dáta a chríochnaíonn d'fhostaíocht, is féidir leat fógra a thabhairt don fhostóir s'agat gur mian leat fágáil roimh dheireadh an tréimhse fógra

source: You do this by completing form RP6 (pdf) and giving it to your employer
ga: Déanann tú é seo tríd an bhfoirm RP6 (pdf) a chomhlánú agus a thabhairt go dtí d'fhostóir

source: Your employer has discretion as to whether to grant your request or not
ga: Tá rogha ag an bhfostóir s'agat an iarratas a cheadú nó gan a cheadú

source: You should note that leaving during the notice period without your employer's agreement may affect your entitlement to a redundancy payment
ga: Ba chóir duit nótáil go bhféadfadh fágáil le linn an tréimhse fógra, gan chomhaontú ó d'fhostóir, goilliúint ar an teidlíocht s'agat d'íocaíocht iomarcaíochta

source: When you lose your job you should register as unemployed by signing on with your local social welfare office
ga: Nuair a chailleann tú do phost, ba chóir duit clárú mar dhuine dífhostaithe trí shíniú le d'oifig leasa shóisialaigh áitiúil

source: If you have enough social insurance contributions you may be entitled to Jobseeker’s Benefit
ga: Má tá go leor ranníocaíochtaí árachais shóisialta agat d'fhéadfá a bheith i dteideal Sochar Cuardaitheora Poist a fháil

source: If you do not have enough PRSI contributions you may qualify for Jobseeker’s Allowance which is a means-tested benefit
ga: Mura bhfuil go leor ranníocaíochtaí ÁSPC agat d'fhéadfá cáiliú le haghaidh Liúntas Cuardaitheora Poist atá ina shochar de réir tástála acmhainne

source: Your employer must give you at least 2 weeks' written notice of the redundancy
ga: Ní mór do d’fhostóir 2 sheachtain d’fhógra scríofa na hiomarcaíochta a thabhairt duit

source: On the date of the termination of employment your employer should pay the redundancy lump sum due to you
ga: Ar dháta foirceannadh fostaíochta ní mór do d’fhostóir cnapshuim iomarcaíochta a íoc leat atá dlite duit

source: If your employer is paying you the redundancy lump sum, they are not required to submit an RP50 form
ga: Má íocann d’fhostóir do chnapshuim iomarcaíochta duit, níl orthu foirm RP50 a chur isteach

source: However your employer should get proof of payment of your lump sum to you and give you a copy of the proof of payment
ga: Áfach, ba chóir do d’fhostóir cruthúnas go n-íocfar an chnapshuim duit a fháil agus cóip an chruthúnais a thabhairt duit

source: If your employer has not paid your redundancy lump sum, you should apply to your employer for it using form RP 77 (pdf)
ga: Mura bhfuil do chnapshuim iomarcaíochta íoctha ag d’fhostóir, ba chóir duit iarratas ar d'fhostóir a dhéanamh ar fhoirm RP77 (pdf)

source: If your employer still does not pay it, you can apply to the Department of Social Protection for direct payment from the Social Insurance Fund as follows:
ga: Má dhiúltaíonn d'fhostóir don íocaíocht fós, is féidir leat iarratas a chur isteach chuig an Roinn Coimirce Sóisialaí le haghaidh íocaíochta dírí ón gCiste Árachais Shóisialaigh mar a leanas:

source: • If your employer is unable to pay your redundancy lump sum, they should complete and sign form RP50
ga: • Mura bhfuil d’fhostóir in ann do chnapshuim iomarcaíochta a íoc, ba chóir dó an fhoirm RP50 a shíniú

source: They should also submit a letter from an accountant or solicitor stating they are unable to pay and accepting liability for 100% of the lump sum owing to the Social Insurance Fund
ga: Ba chóir dó litir ó chuntasóir nó dhlíodóir a chur isteach le rá nach bhfuil sé ábalta íocaíocht a dhéanamh agus go nglacann sé le dliteanas maidir leis an 100% atá dlite don Chiste Árachais Shóisialaigh

source: Documentary evidence such as audited accounts should also be included
ga: Ba chóir fianaise dhoiciméadach amhail cuntais iniúchta a iniamh freisin

source: • If your employer refuses to pay your redundancy lump sum or if there is a dispute about redundancy you can bring a claim to the Workplace Relations Commission
ga: • Má dhiúltaíonn d’fhostóir do chnapshuim iomarcaíochta a íoc nó má bhíonn conspóid ann maidir le hiomarcaíocht is féidir leat éileamh a dhéanamh ar an gCoimisiún um Chaidreamh san Áit Oibre

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: This must be done within one year of your dismissal
ga: Caithfear seo a dhéanamh laistigh de bhliain amháin ó do dhífhostú

source: Then you apply for your lump sum by sending a completed form RP50 to the Redundancy Payments Section together with a favourable decision from the adjudicator of the Workplace Relations Commission
ga: Ansin déanann tú iarratas ar do chnapshuim trí fhoirm RP50 chomhlánaithe a chur isteach agus cinneadh fabhrach ó breithneoir an Choimisiúin um Chaidreamh san Áit Oibre ag gabháil léi

source: Insolvency: If the company has been liquidated or is in receivership, the completed form RP50 should be sent in by the liquidator or receiver on behalf of the employees. You can read this list of frequently asked questions about redundancy
ga: Dócmhainneacht: Má tá an comhlacht leachtaithe nó curtha faoi ghlacadóireacht, ba chóir don leachtaitheoir nó glacadóir ar son fhostaithe an fhoirm RP50 comhlánaithe a chur isteach

source: The application for payment from the Social Insurance Fund should be sent to:
ga: Is féidir teacht ar liosta ceisteanna coitianta maidir le hiomarcaíocht
